# Pandas Operations

In [1]:
import pandas as pd

# Sample DataSet

In [2]:
d = {
    'Name'  : ['Wanda','Eric','John','Andy','Deborah','Charles','James'],
    'Sex': ['Female', 'Male', 'Male', 'Male','Female', 'Male','Male'],
    'City'  : ['Stamford', 'Stamford', 'New York', 'Philadelphia', 'Philadelphia','Stamford','New York'],
    'Frequency': ['Weekly', 'Daily','Weekly', 'Monthly', 'Daily', 'Weekly','Daily'],
    'Item'     : ['Burger', 'Chalupa', 'Sushi','Ice Cream', 'Chalupa', 'Sushi','Donut'],
    'Spend'    : [15,10,42,11,23,93,37]
}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

      Name     Sex          City Frequency       Item  Spend
0    Wanda  Female      Stamford    Weekly     Burger     15
1     Eric    Male      Stamford     Daily    Chalupa     10
2     John    Male      New York    Weekly      Sushi     42
3     Andy    Male  Philadelphia   Monthly  Ice Cream     11
4  Deborah  Female  Philadelphia     Daily    Chalupa     23
5  Charles    Male      Stamford    Weekly      Sushi     93
6    James    Male      New York     Daily      Donut     37

In [9]:
# head and tail

df.head() # 1st five data

      Name     Sex          City Frequency       Item  Spend
0    Wanda  Female      Stamford    Weekly     Burger     15
1     Eric    Male      Stamford     Daily    Chalupa     10
2     John    Male      New York    Weekly      Sushi     42
3     Andy    Male  Philadelphia   Monthly  Ice Cream     11
4  Deborah  Female  Philadelphia     Daily    Chalupa     23

In [10]:
df.tail(3) # last five

      Name     Sex          City Frequency     Item  Spend
4  Deborah  Female  Philadelphia     Daily  Chalupa     23
5  Charles    Male      Stamford    Weekly    Sushi     93
6    James    Male      New York     Daily    Donut     37

In [11]:
# .unique and nunique

df['Sex'].unique()

array(['Female', 'Male'], dtype=object)

In [12]:
df['Sex'].nunique()

2

In [15]:
df['Item'].nunique()

5

In [16]:
# .value_counts()

df['City'].value_counts()

Stamford        3
New York        2
Philadelphia    2
Name: City, dtype: int64

In [17]:
# .apply

def vat(x):
    
    return x * 0.02

In [23]:
df['Tax'] = df['Spend'].apply(lambda x: x * 0.02)

In [24]:
df

      Name     Sex          City Frequency       Item  Spend   Tax
0    Wanda  Female      Stamford    Weekly     Burger     15  0.30
1     Eric    Male      Stamford     Daily    Chalupa     10  0.20
2     John    Male      New York    Weekly      Sushi     42  0.84
3     Andy    Male  Philadelphia   Monthly  Ice Cream     11  0.22
4  Deborah  Female  Philadelphia     Daily    Chalupa     23  0.46
5  Charles    Male      Stamford    Weekly      Sushi     93  1.86
6    James    Male      New York     Daily      Donut     37  0.74

In [25]:
# .sum(), .mean(), .std(), .var(), .count(), median()

df['Spend'].mean()

33.0

In [26]:
df['Spend'].var()

855.6666666666666

In [27]:
df['Spend'].std()

29.25178057258509

In [ ]:
# .sort_values, isnull() --> check other lectures